### 📦 Plan for `sbx/eu-west-1/infra-01/cluster-01/010_eks`
```hcl
04:18:49.103 STDOUT terraform: Terraform used the selected providers to generate the following execution
04:18:49.104 STDOUT terraform: plan. Resource actions are indicated with the following symbols:
04:18:49.104 STDOUT terraform:   + create
04:18:49.104 STDOUT terraform:  <= read (data resources)
04:18:49.104 STDOUT terraform: Terraform will perform the following actions:
04:18:49.104 STDOUT terraform:   # aws_ec2_tag.karpenter_public["subnet-1"] will be created
04:18:49.104 STDOUT terraform:   + resource "aws_ec2_tag" "karpenter_public" {
04:18:49.104 STDOUT terraform:       + id          = (known after apply)
04:18:49.104 STDOUT terraform:       + key         = "karpenter.sh/discovery"
04:18:49.104 STDOUT terraform:       + resource_id = "subnet-1"
04:18:49.104 STDOUT terraform:       + value       = "sbx-dev-eu-west-1-cluster-01-infra-01"
04:18:49.104 STDOUT terraform:     }
04:18:49.104 STDOUT terraform:   # aws_ec2_tag.karpenter_public["subnet-2"] will be created
04:18:49.104 STDOUT terraform:   + resource "aws_ec2_tag" "karpenter_public" {
04:18:49.104 STDOUT terraform:       + id          = (known after apply)
04:18:49.104 STDOUT terraform:       + key         = "karpenter.sh/discovery"
04:18:49.104 STDOUT terraform:       + resource_id = "subnet-2"
04:18:49.104 STDOUT terraform:       + value       = "sbx-dev-eu-west-1-cluster-01-infra-01"
04:18:49.105 STDOUT terraform:     }
04:18:49.105 STDOUT terraform:   # aws_ec2_tag.karpenter_public["subnet-3"] will be created
04:18:49.105 STDOUT terraform:   + resource "aws_ec2_tag" "karpenter_public" {
04:18:49.105 STDOUT terraform:       + id          = (known after apply)
04:18:49.105 STDOUT terraform:       + key         = "karpenter.sh/discovery"
04:18:49.105 STDOUT terraform:       + resource_id = "subnet-3"
04:18:49.105 STDOUT terraform:       + value       = "sbx-dev-eu-west-1-cluster-01-infra-01"
04:18:49.105 STDOUT terraform:     }
04:18:49.105 STDOUT terraform:   # aws_route53_record.ns will be created
04:18:49.105 STDOUT terraform:   + resource "aws_route53_record" "ns" {
04:18:49.105 STDOUT terraform:       + allow_overwrite = (known after apply)
04:18:49.105 STDOUT terraform:       + fqdn            = (known after apply)
04:18:49.105 STDOUT terraform:       + id              = (known after apply)
04:18:49.105 STDOUT terraform:       + name            = "sbx-dev-eu-west-1-cluster-01-infra-01.genopsx.com"
04:18:49.105 STDOUT terraform:       + records         = (known after apply)
04:18:49.105 STDOUT terraform:       + ttl             = 300
04:18:49.105 STDOUT terraform:       + type            = "NS"
04:18:49.105 STDOUT terraform:       + zone_id         = "Z007063513EIRKOFIWQ9J"
04:18:49.105 STDOUT terraform:     }
04:18:49.105 STDOUT terraform:   # aws_route53_zone.cluster_zone will be created
04:18:49.105 STDOUT terraform:   + resource "aws_route53_zone" "cluster_zone" {
04:18:49.105 STDOUT terraform:       + arn                 = (known after apply)
04:18:49.106 STDOUT terraform:       + comment             = "Separate zone for sbx-dev-eu-west-1-cluster-01-infra-01 cluster"
04:18:49.106 STDOUT terraform:       + force_destroy       = true
04:18:49.106 STDOUT terraform:       + id                  = (known after apply)
04:18:49.106 STDOUT terraform:       + name                = "sbx-dev-eu-west-1-cluster-01-infra-01.genopsx.com"
04:18:49.106 STDOUT terraform:       + name_servers        = (known after apply)
04:18:49.106 STDOUT terraform:       + primary_name_server = (known after apply)
04:18:49.106 STDOUT terraform:       + tags                = (known after apply)
04:18:49.106 STDOUT terraform:       + tags_all            = (known after apply)
04:18:49.106 STDOUT terraform:       + zone_id             = (known after apply)
04:18:49.106 STDOUT terraform:     }
04:18:49.106 STDOUT terraform:   # module.certificate.aws_acm_certificate.this[0] will be created
04:18:49.106 STDOUT terraform:   + resource "aws_acm_certificate" "this" {
04:18:49.106 STDOUT terraform:       + arn                       = (known after apply)
04:18:49.106 STDOUT terraform:       + domain_name               = "sbx-dev-eu-west-1-cluster-01-infra-01.genopsx.com"
04:18:49.106 STDOUT terraform:       + domain_validation_options = [
04:18:49.106 STDOUT terraform:           + {
04:18:49.106 STDOUT terraform:               + domain_name           = "*.sbx-dev-eu-west-1-cluster-01-infra-01.genopsx.com"
04:18:49.107 STDOUT terraform:               + resource_record_name  = (known after apply)
04:18:49.107 STDOUT terraform:               + resource_record_type  = (known after apply)
04:18:49.107 STDOUT terraform:               + resource_record_value = (known after apply)
04:18:49.107 STDOUT terraform:             },
04:18:49.107 STDOUT terraform:           + {
04:18:49.107 STDOUT terraform:               + domain_name           = "sbx-dev-eu-west-1-cluster-01-infra-01.genopsx.com"
04:18:49.107 STDOUT terraform:               + resource_record_name  = (known after apply)
04:18:49.107 STDOUT terraform:               + resource_record_type  = (known after apply)
04:18:49.107 STDOUT terraform:               + resource_record_value = (known after apply)
04:18:49.107 STDOUT terraform:             },
04:18:49.107 STDOUT terraform:         ]
04:18:49.107 STDOUT terraform:       + id                        = (known after apply)
04:18:49.107 STDOUT terraform:       + key_algorithm             = (known after apply)
04:18:49.107 STDOUT terraform:       + not_after                 = (known after apply)
04:18:49.107 STDOUT terraform:       + not_before                = (known after apply)
04:18:49.107 STDOUT terraform:       + pending_renewal           = (known after apply)
04:18:49.108 STDOUT terraform:       + renewal_eligibility       = (known after apply)
04:18:49.108 STDOUT terraform:       + renewal_summary           = (known after apply)
04:18:49.108 STDOUT terraform:       + status                    = (known after apply)
04:18:49.108 STDOUT terraform:       + subject_alternative_names = [
04:18:49.108 STDOUT terraform:           + "*.sbx-dev-eu-west-1-cluster-01-infra-01.genopsx.com",
04:18:49.108 STDOUT terraform:           + "sbx-dev-eu-west-1-cluster-01-infra-01.genopsx.com",
04:18:49.108 STDOUT terraform:         ]
04:18:49.108 STDOUT terraform:       + tags                      = {
04:18:49.108 STDOUT terraform:           + "Environment" = "dev"
04:18:49.108 STDOUT terraform:           + "Terragrunt"  = "true"
04:18:49.108 STDOUT terraform:         }
04:18:49.108 STDOUT terraform:       + tags_all                  = {
04:18:49.108 STDOUT terraform:           + "Data-classification" = "internal"
04:18:49.108 STDOUT terraform:           + "Environment"         = "dev"
04:18:49.108 STDOUT terraform:           + "Managed-by"          = "terragrunt"
04:18:49.108 STDOUT terraform:           + "Organization"        = "genopsx"
04:18:49.108 STDOUT terraform:           + "Terragrunt"          = "true"
04:18:49.108 STDOUT terraform:         }
04:18:49.108 STDOUT terraform:       + type                      = (known after apply)
04:18:49.108 STDOUT terraform:       + validation_emails         = (known after apply)
04:18:49.108 STDOUT terraform:       + validation_method         = "DNS"
04:18:49.109 STDOUT terraform:       + options {
04:18:49.109 STDOUT terraform:           + certificate_transparency_logging_preference = "ENABLED"
04:18:49.109 STDOUT terraform:         }
04:18:49.109 STDOUT terraform:     }
04:18:49.109 STDOUT terraform:   # module.certificate.aws_acm_certificate_validation.this[0] will be created
04:18:49.109 STDOUT terraform:   + resource "aws_acm_certificate_validation" "this" {
```

💰 Infracost estimate for `sbx/eu-west-1/infra-01/cluster-01/010_eks`
```
Project: main

 Name                                                                                                Monthly Qty  Unit                    Monthly Cost   
                                                                                                                                                         
 module.nodes["my-app-eks-x86"].module.eks_managed_node_groups.aws_eks_node_group.this[0]                                                                
 └─ module.nodes["my-app-eks-x86"].module.eks_managed_node_groups.aws_launch_template.this[0]                                                            
    ├─ Instance usage (Linux/UNIX, on-demand, m7i.4xlarge)                                                 2,190  hours                      $1,968.37   
    ├─ EC2 detailed monitoring                                                                                21  metrics                        $6.30   
    └─ block_device_mapping[0]                                                                                                                           
       └─ Storage (general purpose SSD, gp3)                                                                 900  GB                            $79.20   
                                                                                                                                                         
 module.cluster.aws_eks_cluster.this[0]                                                                                                                  
 └─ EKS cluster                                                                                              730  hours                         $73.00   
                                                                                                                                                         
 module.fargate["my-app-eks-fargate"].module.fargate_profile.aws_eks_fargate_profile.this[0]                                                             
 ├─ Per GB per hour                                                                                            1  GB                             $3.24   
 └─ Per vCPU per hour                                                                                          1  CPU                           $29.55   
                                                                                                                                                         
 module.cluster.module.kms.aws_kms_key.this[0]                                                                                                           
 ├─ Customer master key                                                                                        1  months                         $1.00   
 ├─ Requests                                                                                   Monthly cost depends on usage: $0.03 per 10k requests     
 ├─ ECC GenerateDataKeyPair requests                                                           Monthly cost depends on usage: $0.10 per 10k requests     
 └─ RSA GenerateDataKeyPair requests                                                           Monthly cost depends on usage: $0.10 per 10k requests     
                                                                                                                                                         
 module.ebs_kms_key.module.ebs_kms_key.aws_kms_key.this[0]                                                                                               
 ├─ Customer master key                                                                                        1  months                         $1.00   
 ├─ Requests                                                                                   Monthly cost depends on usage: $0.03 per 10k requests     
 ├─ ECC GenerateDataKeyPair requests                                                           Monthly cost depends on usage: $0.10 per 10k requests     
 └─ RSA GenerateDataKeyPair requests                                                           Monthly cost depends on usage: $0.10 per 10k requests     
                                                                                                                                                         
 aws_route53_zone.cluster_zone                                                                                                                           
 └─ Hosted zone                                                                                                1  months                         $0.50   
                                                                                                                                                         
 aws_route53_record.ns                                                                                                                                   
 ├─ Standard queries (first 1B)                                                                Monthly cost depends on usage: $0.40 per 1M queries       
 ├─ Latency based routing queries (first 1B)                                                   Monthly cost depends on usage: $0.60 per 1M queries       
 └─ Geo DNS queries (first 1B)                                                                 Monthly cost depends on usage: $0.70 per 1M queries       
                                                                                                                                                         
 module.certificate.aws_route53_record.validation[0]                                                                                                     
 ├─ Standard queries (first 1B)                                                                Monthly cost depends on usage: $0.40 per 1M queries       
 ├─ Latency based routing queries (first 1B)                                                   Monthly cost depends on usage: $0.60 per 1M queries       
 └─ Geo DNS queries (first 1B)                                                                 Monthly cost depends on usage: $0.70 per 1M queries       
                                                                                                                                                         
 module.cluster.aws_cloudwatch_log_group.this[0]                                                                                                         
 ├─ Data ingested                                                                              Monthly cost depends on usage: $0.57 per GB               
 ├─ Archival Storage                                                                           Monthly cost depends on usage: $0.03 per GB               
 └─ Insights queries data scanned                                                              Monthly cost depends on usage: $0.0057 per GB             
                                                                                                                                                         
 module.ingress_alb_access_logs.module.alb_access_logs.aws_s3_bucket.this[0]                                                                             
 └─ Standard                                                                                                                                             
    ├─ Storage                                                                                 Monthly cost depends on usage: $0.023 per GB              
    ├─ PUT, COPY, POST, LIST requests                                                          Monthly cost depends on usage: $0.005 per 1k requests     
    ├─ GET, SELECT, and all other requests                                                     Monthly cost depends on usage: $0.0004 per 1k requests    
    ├─ Select data scanned                                                                     Monthly cost depends on usage: $0.002 per GB              
    └─ Select data returned                                                                    Monthly cost depends on usage: $0.0007 per GB             
                                                                                                                                                         
 OVERALL TOTAL                                                                                                                              $2,162.17 

*Usage costs can be estimated by updating Infracost Cloud settings, see docs for other options.

──────────────────────────────────
113 cloud resources were detected:
∙ 10 were estimated
∙ 99 were free
∙ 4 are not supported yet, rerun with --show-skipped to see details

┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┳━━━━━━━━━━━━━━━┳━━━━━━━━━━━━━┳━━━━━━━━━━━━┓
┃ Project                                            ┃ Baseline cost ┃ Usage cost* ┃ Total cost ┃
┣━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━╋━━━━━━━━━━━━━━━╋━━━━━━━━━━━━━╋━━━━━━━━━━━━┫
┃ main                                               ┃        $2,162 ┃           - ┃     $2,162 ┃
┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┻━━━━━━━━━━━━━━━┻━━━━━━━━━━━━━┻━━━━━━━━━━━━┛
```
